Repository: oganaa2472/wash_service
Catalog: lib/core/localization/l10n/app_*.arb
Languages: mn

# appName
source: MGL Smart Wash
mn: MGL Ухаалаг Угаалга

# appTagline
source: Your Smart Washing Solution
mn: Таны Ухаалаг Угаалгын Шийдэл

source: Login
mn: Нэвтрэх

source: Email
mn: И-мэйл

source: Phone
mn: Утас

source: Password
mn: Нууц үг

source: Confirm Password
mn: Нууц үг баталгаажуулах

source: Submit
mn: Илгээх

source: Cancel
mn: Цуцлах

source: Save
mn: Хадгалах

source: Delete
mn: Устгах

source: Edit
mn: Засах

source: Add
mn: Нэмэх

source: Search
mn: Хайх

source: Loading...
mn: Уншиж байна...

source: Error
mn: Алдаа

source: Success
mn: Амжилттай

source: Warning
mn: Анхааруулга

source: Info
mn: Мэдээлэл

source: Retry
mn: Дахин оролдох

source: Back
mn: Буцах

source: Next
mn: Дараах

source: Previous
mn: Өмнөх

source: Done
mn: Дууссан

source: Skip
mn: Алгасах

source: Continue
mn: Үргэлжлүүлэх

source: Finish
mn: Дуусгах

source: Close
mn: Хаах

source: OK
mn: Тийм

source: Yes
mn: Тийм

source: No
mn: Үгүй

# loginTitle
source: Welcome Back
mn: Дахин тавтай морил

# loginSubtitle
source: Sign in to your account
mn: Бүртгэлдээ нэвтэрнэ үү

# enterEmailOrPhone
source: Enter your email or phone number
mn: И-мэйл эсвэл утасны дугаараа оруулна уу

# enterValidEmail
source: Please enter a valid email address
mn: Зөв и-мэйл хаяг оруулна уу

# enterValidPhone
source: Please enter a valid phone number
mn: Зөв утасны дугаар оруулна уу

source: Send OTP
mn: OTP илгээх

# verifyOtp
source: Verify Code
mn: Кодыг баталгаажуулах

# otpSent
source: OTP sent successfully
mn: OTP амжилттай илгээгдлээ

# enterOtp
source: Enter the verification code
mn: Баталгаажуулах кодыг оруулна уу

# resendOtp
source: Resend
mn: Дахин илгээх

# resendOtpIn
source: Resend in {seconds}s
mn: {seconds} секундын дараа дахин илгээх

# invalidOtp
source: Invalid verification code
mn: Буруу баталгаажуулах код

# otpExpired
source: Verification code expired
mn: Баталгаажуулах кодын хугацаа дууссан

# loginSuccess
source: Login successful
mn: Амжилттай нэвтэрлээ

source: Login failed
mn: Нэвтрэх амжилтгүй

source: Logout
mn: Гарах

# logoutSuccess
source: Logout successful
mn: Амжилттай гарлаа

source: Logout failed
mn: Гарах амжилтгүй

source: Home
mn: Нүүр

source: Profile
mn: Профайл

source: Settings
mn: Тохиргоо

source: Notifications
mn: Мэдэгдэл

source: Help
mn: Тусламж

source: About
mn: Тухай

source: Contact Us
mn: Бидэнтэй холбогдох

source: Privacy Policy
mn: Нууцлалын бодлого

source: Terms of Service
mn: Үйлчилгээний нөхцөл

source: Companies
mn: Компаниуд

source: Company
mn: Компани

source: Add Company
mn: Компани нэмэх

source: Edit Company
mn: Компани засах

source: Company Name
mn: Компанийн нэр

source: Company Address
mn: Компанийн хаяг

source: Company Logo
mn: Компанийн лого

source: Company Category
mn: Компанийн ангилал

source: Company Details
mn: Компанийн дэлгэрэнгүй

# companyAdded
source: Company added successfully
mn: Компани амжилттай нэмэгдлээ

# companyUpdated
source: Company updated successfully
mn: Компани амжилттай шинэчлэгдлээ

# companyDeleted
source: Company deleted successfully
mn: Компани амжилттай устгагдлаа

source: Orders
mn: Захиалгууд

source: Order
mn: Захиалга

source: Add Order
mn: Захиалга нэмэх

source: Edit Order
mn: Захиалга засах

source: Order Details
mn: Захиалгын дэлгэрэнгүй

source: Order Status
mn: Захиалгын төлөв

source: Order Date
mn: Захиалгын огноо

source: Order Time
mn: Захиалгын цаг

source: Order Total
mn: Захиалгын нийт

source: Order Payment
mn: Захиалгын төлбөр

source: Order Completed
mn: Захиалга дууссан

source: Order Cancelled
mn: Захиалга цуцлагдсан

source: Order Pending
mn: Захиалга хүлээгдэж байна

source: Services
mn: Үйлчилгээнүүд

source: Service
mn: Үйлчилгээ

source: Service Name
mn: Үйлчилгээний нэр

source: Service Description
mn: Үйлчилгээний тайлбар

source: Service Price
mn: Үйлчилгээний үнэ

source: Service Duration
mn: Үйлчилгээний хугацаа

source: Service Category
mn: Үйлчилгээний ангилал

source: Payment
mn: Төлбөр

source: Payment Method
mn: Төлбөрийн арга

source: Payment Methods
mn: Төлбөрийн аргууд

source: Add Payment Method
mn: Төлбөрийн арга нэмэх

source: Edit Payment Method
mn: Төлбөрийн арга засах

source: Payment Details
mn: Төлбөрийн дэлгэрэнгүй

# paymentSuccess
source: Payment successful
mn: Төлбөр амжилттай

source: Payment failed
mn: Төлбөр амжилтгүй

source: Payment pending
mn: Төлбөр хүлээгдэж байна

source: Payment cancelled
mn: Төлбөр цуцлагдсан

# networkError
source: Network error. Please check your connection.
mn: Сүлжээний алдаа. Холболтоо шалгана уу.

# serverError
source: Server error. Please try again later.
mn: Серверийн алдаа. Дараа дахин оролдоно уу.

# unknownError
source: An unknown error occurred.
mn: Үл мэдэгдэх алдаа гарлаа.

source: Try Again
mn: Дахин оролдох

# checkConnection
source: Please check your internet connection.
mn: Интернэт холболтоо шалгана уу.

# requiredField
source: This field is required
mn: Энэ талбар заавал бөглөх

source: Invalid format
mn: Буруу формат

# minLength
source: Minimum length is {min} characters
mn: Хамгийн багадаа {min} тэмдэгт

# maxLength
source: Maximum length is {max} characters
mn: Хамгийн ихдээ {max} тэмдэгт

# invalidEmail
source: Please enter a valid email address
mn: Зөв и-мэйл хаяг оруулна уу

# invalidPhone
source: Please enter a valid phone number
mn: Зөв утасны дугаар оруулна уу

# passwordMismatch
source: Passwords do not match
mn: Нууц үгнүүд таарахгүй байна

source: Verification Code
mn: Баталгаажуулах код

# weHaveSentCode
source: We have sent a verification code to
mn: Бид баталгаажуулах кодыг илгээлээ

# didntReceiveCode
source: Didn't receive the code?
mn: Код хүлээж аваагүй юу?

source: Verify
mn: Баталгаажуулах

# pleaseEnter6DigitCode
source: Please enter a 6-digit verification code
mn: 6 оронтой баталгаажуулах код оруулна уу

source: Please enter only numbers
mn: Зөвхөн тоо оруулна уу

source: Assistant
mn: Туслах

# assistantTitle
source: AI Assistant
mn: AI Туслах

# assistantSubtitle
source: Get help with your questions
mn: Асуултаа асуугаад тусламж аваарай

# askQuestion
source: Ask a question...
mn: Асуулт асуу...

source: Send
mn: Илгээх

source: Typing...
mn: Бичиж байна...

source: Wash Service
mn: Угаалгын үйлчилгээ

source: Wash Services
mn: Угаалгын үйлчилгээнүүд

source: Add Wash Service
mn: Угаалгын үйлчилгээ нэмэх

source: Edit Wash Service
mn: Угаалгын үйлчилгээ засах

source: Wash Service Details
mn: Угаалгын үйлчилгээний дэлгэрэнгүй

# washServiceName
source: Service Name
mn: Үйлчилгээний нэр

# washServicePrice
source: Service Price
mn: Үйлчилгээний үнэ

# washServiceDuration
source: Service Duration
mn: Үйлчилгээний хугацаа

# washServiceDescription
source: Service Description
mn: Үйлчилгээний тайлбар

source: Employees
mn: Ажилчид

source: Employee
mn: Ажилчин

source: Add Employee
mn: Ажилчин нэмэх

source: Edit Employee
mn: Ажилчин засах

source: Employee Details
mn: Ажилчны дэлгэрэнгүй

source: Employee Name
mn: Ажилчны нэр

source: Employee Phone
mn: Ажилчны утас

source: Employee Email
mn: Ажилчны и-мэйл

source: Employee Role
mn: Ажилчны үүрэг

source: Cars
mn: Машинууд

source: Car
mn: Машин

source: Add Car
mn: Машин нэмэх

source: Edit Car
mn: Машин засах

source: Car Details
mn: Машины дэлгэрэнгүй

source: Car Brand
mn: Машины брэнд

source: Car Model
mn: Машины загвар

source: Car Year
mn: Машины он

source: Car Color
mn: Машины өнгө

# carPlate
source: License Plate
mn: Улсын дугаар

source: Version Check
mn: Верс шалгах

source: Update Available
mn: Шинэчлэлт боломжтой

source: Current Version
mn: Одоогийн верс

source: Latest Version
mn: Хамгийн сүүлийн верс

source: Update Now
mn: Одоо шинэчлэх

source: Skip Update
mn: Шинэчлэхийг алгасах

# youAreUsingLatestVersion
source: You are using the latest version!
mn: Та хамгийн сүүлийн версийг ашиглаж байна!

# failedToCheckUpdates
source: Failed to check for updates: {error}
mn: Шинэчлэлт шалгахад алдаа гарлаа: {error}

# generalError
source: Something went wrong. Please try again.
mn: Алдаа гарлаа. Дахин оролдоно уу.

# networkErrorShort
source: Please check your internet connection.
mn: Интернэт холболтоо шалгана уу.
